AirandTemV2/0/airRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/airRegion";
    object      cellToRegion;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inLetAir
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 360;
    }
    outLetAir
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    yFront
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    yBack
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    groundWall
    {
        type            zeroGradient;
    }
    topWall
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    airRegion_to_panel
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
        kappa           none;
        inletValue      uniform 300;
        thermalInertia  true;
    }
}


// ************************************************************************* //
